{
  "title": "What you need to know about me",
  "subtitle": "",
  "slug": "hire-me",
  "section": "",
  "url": "/hire-me/",
  "body": "I think it's important that anyone considering working with me understands who I am and how I work. Ultimately, it's where our values meet and overlap that's going to determine whether or not we're a good fit for each other. What someone does can change pretty quickly, but who they are typically can't. So, let me tell you who I am.\r\n\r\n### In general\r\n\r\nI'm an autodidact: there's nothing I've needed to learn that I've not been able to teach myself, though, through trial and error, I've also learned when to ask for help. I listen more than I speak, and when I speak I try to make sure that what I say is worth hearing. I'm honest, sometimes brutally; I can't turn this off because when I lie it feels like I'm being torn in two. I have obsessive-compulsive tendencies; the compulsive part is mostly controlled but the obsession is not, which, though it has its downsides, means I'm dedicated to delivering. I'm aware of my limitations, but not all of them, and I'm grateful when the ones don't perceive are revealed to me. I have a curious, playful and mischievous mind that gets restless, which is why I'm a full-stack developer: the variety keeps me interested.\r\n\r\n### In development\r\n\r\nI'm not a \"10x\" developer, but I think I'm a capable one. I try to write code that is easy to understand and design applications that are easy to use. I find repetition boring, so I try to eliminate it through automation wherever possible; I care about people's time so I also try to eliminate other mundane tasks by the same means. I work best with people who care about both what they're building and the people who are going to use it. I don't always document as I go, but I care about the people who will inherit my work, so I do my best to make sure documentation gets written; experience has shown me the misery one's life can become when adequate documentation isn't provided. Also, *sometimes* I actually find documenting quite therapeutic. I've spent thousands of hours of my life coding and, although I enjoy it, I don't want to do it forever. My favourite thing about development is the outcome. Development is a process and coding a means to an end. I care about fulfilling a single purpose: bring ideas into reality.\r\n\r\nIf I sound like the type of person you'd like to work with, please get in touch via [twitter](https://twitter.com/LatnBlack).",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "created": "2017-07-26T15:01:21.831Z",
  "updated": "2017-07-26T17:05:27.402Z",
  "published": "",
  "contentType": "page",
  "id": "HJqp0mUUb"
}