{
  "title": "Why another CMS?",
  "subtitle": "",
  "slug": "why-another-cms",
  "section": "gincms",
  "url": "/gincms/why-another-cms/",
  "body": "On Wednesday, 22nd of February, 2017, I attended Hacks/Hackers in London. That evening I heard Matt Kiser, the founder of [WTFJHT](1), speaking about the creation of his site, the tools and services he uses, and how he made it a collaborative/community aspect of the site works. In the process, he vindicated an idea that had been tumbling around in my mind for some time: code and content can share the same workflow.\r\n\r\n### Teams\r\n\r\nWhen working in a team, people are usually working on different parts of the product, so one person's work won't necessarily have an impact on another's. But even when there is overlap, consistent updates and communication among team members can mitigate any major conflicts. This is fairly universal. Yet, there are fundamental differences between development and content teams when it comes to the ways they work, and I think it mainly comes down to the tools that are available.\r\n\r\n### Tools\r\n\r\nSpeak to pretty much any developer, even the least experienced, and they've almost certainly heard of version control. I've never come across a developer that *doesn't* know what a VCS is (although I'm sure there's one out there somewhere, and we'll not discuss those who just flat out refuse to adopt any form of version control—yes, they exist too). In contrast, I've found that content creators have a very limited—if any—idea of version control. At best, they have a concept of *history* or *versions*, as found in software like Wordpress, Microsoft Word, or Google Docs, if they're so savvy.\r\n\r\n### Control\r\n\r\nIt's not difficult to understand why the average content creator has no idea about version control. In development it's standard practice to use source control. \r\n\r\n[1]:http://whatthefuckjusthappenedtoday.com",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "blog": "1",
  "created": "2017-05-10T07:43:55.179Z",
  "updated": "2017-05-10T09:20:53.700Z",
  "published": "",
  "contentType": "page",
  "id": "SyXaNregb"
}